a={1:'a'}
a[2]='b'
print(a) #{1:'a',2:'b'}
a['name']='홍길동'
print(a) #{1:'a',2:'b','name':'홍길동'}
a['3']=[1,2,3]
print(a) #{1:'a',2:'b','name':'홍길동',3:[1,2,3]}
dic={}
print(dic)

dic={'이름':'홍길동','나이':12,'성별':'남성','생일':'12월1일'}
print(dic)

ice = {"메로나":1000,"비비빅":1200,'빵빠레':1800}
print(ice)

ice = {"메로나":1000,"비비빅":1200,'빵빠레':1800}
ice["죠스바"]=1200
ice["월드콘"]=1500
print(ice)

ice = {"메로나":1000,"비비빅":1200,'빵빠레':1800,"죠스바":1200,"월드콘":1500}
print("메로나 가격:",ice["메로나"])
ice = {"메로나":1000,"비비빅":1200,'빵빠레':1800,"죠스바":1200,"월드콘":1500}
ice["메로나"]=1300
print(ice)

ice = {"메로나":1000,"비비빅":1200,'빵빠레':1800,"죠스바":1200,"월드콘":1500}
del ice["빵빠레"]
print(ice)
 
ice = {"메로나":[1000,2],"비비빅":[1200,24],'빵빠레':[1800,39],"죠스바":[1200,26],"월드콘":[1500,33]}
print(ice)
ice = {"메로나":[1000,2],"비비빅":[1200,24],'빵빠레':[1800,39],"죠스바":[1200,26],"월드콘":[1500,33]}
print(ice["메로나"][0],"원")
print(ice["메로나"][1],"개")

s1=set([1,2,3])
s1.add(4)
print(s1) #{1,2,3,4}

s1=set([1,2,3])
s1.update([4,5,6])
print(s1) #{1,2,3,4,5,6}

s1=set([1,2,3])
s1.remove(2)
print(s1) #{1,3}
print("="*40)

A=set([2,1,3,5,7,10,100,283])
B=set([3,4,1,6,22,100,302])
print(A&B)
print(A|B)
print(A-B)
print(B-A)
점수들 = [90,25,67,45,80]
number=0

for 점수 in 점수들:
    number = number+1
    if 점수>= 60:
        print("{}번 학생은 합격입니다.".format(number))
    else:
        print("{}번 학생은 불합격입니다.".format(number))

for 숫자 in[10,20,30]:
    print(숫자)
    print("_________")
리스트=["김밥","라면","튀김"]
for 메뉴 in 리스트:
    print("오늘의 메뉴:"+메뉴)

리스트=[3,-20,-3,44]
for 변수 in 리스트:
    if 변수 <0:
        print (변수)

튜플=(-3,100,23,44,103,28,99,65,63,3333)
for 변수 in 튜플:
    if 변수%3 == 0:
        print (변수)

동물들=['강아지','고양이','앵무새','백상아리', '오스트랄로피테쿠스']
for 동물 in 동물들:
    글자수=len(동물)
    print("{},{}".format(동물,글자수))
